{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature report mapping implemented features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file.",
  "frontend/index.css": "Tailwind base and theme variables defining a warm amber/teal color system for light and dark modes.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root component rendering HomeScreenSandboxPage.",
  "frontend/src/features/homeScreenSandbox/components/DesktopTiltControl.tsx": "UI pad and keyboard handler allowing desktop users to manipulate gravity vector.",
  "frontend/src/features/homeScreenSandbox/components/DeviceScreenFrame.tsx": "Renders a phone-style frame with wallpaper, hosting the simulation canvas.",
  "frontend/src/features/homeScreenSandbox/components/IconPhysicsCanvas.tsx": "Canvas renderer that loads icons, runs physics simulation, and draws bodies each frame.",
  "frontend/src/features/homeScreenSandbox/components/MotionPermissionPanel.tsx": "Permission request card for enabling device motion access with messaging for errors and denied states.",
  "frontend/src/features/homeScreenSandbox/components/SimulationControlsBar.tsx": "UI bar showing current tilt mode and a reset button for the simulation.",
  "frontend/src/features/homeScreenSandbox/HomeScreenSandboxPage.tsx": "Main page coordinating tilt inputs, physics canvas, permission UI, and controls.",
  "frontend/src/features/homeScreenSandbox/hooks/useDesktopTiltControls.ts": "Hook managing desktop tilt gravity vector with a reset function.",
  "frontend/src/features/homeScreenSandbox/hooks/useDeviceTilt.ts": "Hook handling device orientation input, permissions, and gravity updates.",
  "frontend/src/features/homeScreenSandbox/iconAssets.ts": "Defines icon metadata and exports an array of icon assets.",
  "frontend/src/features/homeScreenSandbox/physics/engine.ts": "Physics engine updating rigid bodies with gravity, damping, and collision handling.",
  "frontend/src/features/homeScreenSandbox/physics/initialLayout.ts": "Generates initial rigid body positions for icons based on screen size.",
  "frontend/src/features/homeScreenSandbox/physics/types.ts": "Type definitions for vectors, rigid bodies, and world parameters.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity auth and state.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point setting up providers and rendering the app.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, layouts, and animations.",
  "project_state.json": "Tracks project metadata, required images, and implemented features for a tilt‑based home‑screen physics simulation app. Contains versioning, descriptions of existing features, and asset requirements."
}